In [3]:
import pandas as pd
import numpy as np

In [10]:
students_perfomance = pd.read_csv('datasets/StudentsPerformance.csv')

In [13]:
students_perfomance.head()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group B,bachelor's degree,standard,none,72,72,74
1,female,group C,some college,standard,completed,69,90,88
2,female,group B,master's degree,standard,none,90,95,93
3,male,group A,associate's degree,free/reduced,none,47,57,44
4,male,group C,some college,standard,none,76,78,75

In [15]:
students_perfomance.describe()

       math score  reading score  writing score
count  1000.00000    1000.000000    1000.000000
mean     66.08900      69.169000      68.054000
std      15.16308      14.600192      15.195657
min       0.00000      17.000000      10.000000
25%      57.00000      59.000000      57.750000
50%      66.00000      70.000000      69.000000
75%      77.00000      79.000000      79.000000
max     100.00000     100.000000     100.000000

In [17]:
students_perfomance.dtypes

gender                         object
race/ethnicity                 object
parental level of education    object
lunch                          object
test preparation course        object
math score                      int64
reading score                   int64
writing score                   int64
dtype: object

In [41]:
students_perfomance.iloc[0:5, 0:3]

   gender race/ethnicity parental level of education
0  female        group B           bachelor's degree
1  female        group C                some college
2  female        group B             master's degree
3    male        group A          associate's degree
4    male        group C                some college

In [27]:
spwn = students_perfomance.iloc[[0,3,4]]

In [53]:
spwn.index = ['alisa', 'vitya', 'kirill']

In [54]:
spwn

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
alisa,female,group B,bachelor's degree,standard,none,72,72,74
vitya,male,group A,associate's degree,free/reduced,none,47,57,44
kirill,male,group C,some college,standard,none,76,78,75

In [56]:
spwn.loc[['vitya', 'kirill'], ['gender']]

       gender
vitya    male
kirill   male

In [57]:
spwn.iloc[:, 0]

alisa     female
vitya       male
kirill      male
Name: gender, dtype: object

In [58]:
my_ser_1 = pd.Series([1, 2, 3], index=['first', 'second', 'third'])
my_ser_2 = pd.Series([4, 5, 6], index=['first', 'second', 'third'])

In [59]:
pd.DataFrame({"col_name_1": my_ser_1, "my_col_2": my_ser_2})

        col_name_1  my_col_2
first            1         4
second           2         5
third            3         6

In [47]:
titanic = pd.read_csv('datasets/titanic.csv')

In [52]:
print(titanic.shape)
print(titanic.dtypes)

(891, 12)
PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object